zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXC/MCXC161/MCXC161_features.h
/* SYSCON module features */

/* @brief Flash page size in bytes */
#define FSL_FEATURE_SYSCON_FLASH_PAGE_SIZE_BYTES (128)
/* @brief Flash sector size in bytes */
#define FSL_FEATURE_SYSCON_FLASH_SECTOR_SIZE_BYTES (8192)
/* @brief Flash size in bytes */
#define FSL_FEATURE_SYSCON_FLASH_SIZE_BYTES (32768)
/* @brief Support ROMAPI */
#define FSL_FEATURE_SYSCON_ROMAPI (1)
/* @brief ROMAPI tree address */
#define FSL_FEATURE_ROMAPI_BASE (0x03005FE0U)
/* @brief ROMAPI support IFR function */
#define FSL_FEATURE_ROMAPI_IFR (0)
/* @brief Powerlib API is different with other series devices */
#define FSL_FEATURE_POWERLIB_EXTEND (1)
/* @brief No OSTIMER register in PMC */
#define FSL_FEATURE_PMC_HAS_NO_OSTIMER_REG (1)
/* @brief Starter register discontinuous. */
#define FSL_FEATURE_SYSCON_STARTER_DISCONTINUOUS (1)
/* @brief Has parity miss (bitfield LPCAC_CTRL[PARITY_MISS_EN]). */
#define FSL_FEATURE_SYSCON_HAS_LPCAC_CTRL_PARITY_MISS_EN_BIT (0)
/* @brief Has parity error report (bitfield LPCAC_CTRL[PARITY_FAULT_EN]). */
#define FSL_FEATURE_SYSCON_HAS_LPCAC_CTRL_PARITY_FAULT_EN_BIT (0)

/* SysTick module features */

/* @brief Systick has external reference clock. */
#define FSL_FEATURE_SYSTICK_HAS_EXT_REF (0)
/* @brief Systick external reference clock is core clock divided by this value. */
#define FSL_FEATURE_SYSTICK_EXT_REF_CORE_DIV (0)

/* TRNG module features */

/* @brief TRNG does not support SCR4L. */
#define FSL_FEATURE_TRNG_HAS_NO_TRNG_SCR4L (0)
/* @brief TRNG does not support SCR5L. */
#define FSL_FEATURE_TRNG_HAS_NO_TRNG_SCR5L (0)
/* @brief TRNG does not support SCR6L. */
#define FSL_FEATURE_TRNG_HAS_NO_TRNG_SCR6L (1)
/* @brief TRNG does not support PKRMAX. */
#define FSL_FEATURE_TRNG_HAS_NO_TRNG_PKRMAX (0)
/* @brief TRNG does not support SAMP mode. */
#define FSL_FEATURE_TRNG_HAS_NO_TRNG_MCTL_SAMP_MODE (1)
/* @brief TRNG does not support ACC. */
#define FSL_FEATURE_TRNG_HAS_NO_TRNG_ACC (1)
/* @brief TRNG does not support SBLIM. */
#define FSL_FEATURE_TRNG_HAS_NO_TRNG_SBLIM (0)
/* @brief TRNG supports reset control. */
#define FSL_FEATURE_TRNG_HAS_RSTCTL (0)
/* @brief TRNG does not support FOR_CLK mode. */
#define FSL_FEATURE_TRNG_HAS_NO_TRNG_MCTL_FOR_CLK_MODE (1)
/* @brief TRNG supports dual oscillator mode. */
#define FSL_FEATURE_TRNG_HAS_DUAL_OSCILATORS (1)
/* @brief TRNG supports control pin. */
#define FSL_FEATURE_TRNG_HAS_CTRL_PIN (0)

/* VBAT module features */

/* @brief Has STATUS register */
#define FSL_FEATURE_MCX_VBAT_HAS_STATUS_REG (1)
/* @brief Has TAMPER register */
#define FSL_FEATURE_MCX_VBAT_HAS_TAMPER_REG (0)
/* @brief Has BANDGAP register */
#define FSL_FEATURE_MCX_VBAT_HAS_BANDGAP_TIMER (0)
/* @brief Has LDOCTL register */
#define FSL_FEATURE_MCX_VBAT_HAS_LDOCTL_REG (0)
/* @brief Has OSCCTL register */
#define FSL_FEATURE_MCX_VBAT_HAS_OSCCTL_REG (1)
/* @brief Has SWICTL register */
#define FSL_FEATURE_MCX_VBAT_HAS_SWICTL_REG (0)
/* @brief Has CLKMON register */
#define FSL_FEATURE_MCX_VBAT_HAS_CLKMON_REG (0)
/* @brief Has FINE_AMP_GAIN bitfield in register OSCCTLA */
#define FSL_FEATURE_MCX_VBAT_HAS_OSCCTLA_FINE_AMP_GAIN_BIT (0)
/* @brief Has OSCCTLB register */
#define FSL_FEATURE_MCX_VBAT_HAS_B_SIDE_REG (0)
/* @brief Has OSCCTLA[MODE_EN] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_OSCCTLA_MODE_EN_BIT (0)
/* @brief Has OSCCFGA[CMP_TRIM] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_OSCCFGA_CMP_TRIM_BIT (0)
/* @brief Has OSCCFGA[DLY_TRIM] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_OSCCFGA_DLY_TRIM_BIT (0)
/* @brief Has OSCCFGA[CAP_TRIM] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_OSCCFGA_CAP_TRIM_BIT (0)
/* @brief Has STATUSA[WAKEUP_FLAG] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_STATUSA_WAKEUP_FLAG_BIT (0)
/* @brief Has STATUSA[TIMER0_FLAG] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_STATUSA_TIMER0_FLAG_BIT (0)
/* @brief Has STATUSA[TIMER1_FLAG] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_STATUSA_TIMER1_FLAG_BIT (0)
/* @brief Has STATUSA[LDO_RDY] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_STATUSA_LDO_RDY_BIT (0)
/* @brief Has STATUSA[IRQ0_DET] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_STATUSA_IRQ0_DET_BIT (0)
/* @brief Has STATUSA[IRQ1_DET] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_STATUSA_IRQ1_DET_BIT (0)
/* @brief Has STATUSA[IRQ2_DET] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_STATUSA_IRQ2_DET_BIT (0)
/* @brief Has STATUSA[IRQ3_DET] bitfield */
#define FSL_FEATURE_MCX_VBAT_HAS_STATUSA_IRQ3_DET_BIT (0)
/* @brief Has WAKENA register */
#define FSL_FEATURE_MCX_VBAT_HAS_WAKENA_REG (0)
/* @brief Has WAKECFG register */
#define FSL_FEATURE_MCX_VBAT_HAS_WAKECFG_REG (0)
/* @brief Has LOCKA register */
#define FSL_FEATURE_MCX_VBAT_HAS_LOCKA_REG (0)

/* WUU module features */

/* @brief Has MF register. */
#define FSL_FEATURE_WUU_HAS_MF (0)

/* WWDT module features */

/* @brief WWDT does not support oscillator lock. */
#define FSL_FEATURE_WWDT_HAS_NO_OSCILLATOR_LOCK (0)
/* @brief soc has reset. */
#define FSL_FEATURE_WWDT_HAS_NO_RESET (1)
/* @brief Has LPOSC as clock source. */
#define FSL_FEATURE_WWDT_HAS_LPOSC_CLOCK_SOURCE (0)
/* @brief WWDT WDTOF is not set in case of WD reset - get info from PMC instead. */
#define FSL_FEATURE_WWDT_WDTRESET_FROM_PMC (0)

#endif /* _MCXC161_FEATURES_H_ */

